In [1]:
import pandas as pd
#Load data ke dataframe

df_aptitude = pd.read_csv('student_aptitude_data.csv')
df_performance = pd.read_csv('student_performance_data.csv')

In [2]:
# Cek info detail setiap dataframe
df_aptitude.info()
df_performance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   student_id      150 non-null    int64
 1   course_level    150 non-null    object
 2   aptitude_score  150 non-null    int64
dtypes: int64(2), object(1)
memory usage: 3.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   student_id         150 non-null    int64
 1   course_level       150 non-null    object
 2   performance_score  150 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 3.6+ KB

In [ ]:
# Cek duplicate data
df_aptitude['student_id'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150])

In [8]:
# Gabungkan semua sekaligus
df_merged = pd.merge(
    df_aptitude,
    df_performance,
    on=['student_id', 'course_level'],
    how='outer'
)

In [9]:
df_merged.head()

   student_id course_level  aptitude_score  performance_score
0           1     Advanced              72               3.70
1           2     Advanced              90               3.65
2           3     Advanced              68               3.55
3           4     Advanced              84               3.45
4           5     Advanced              72               3.55

In [10]:
# Cek describe
df_merged.describe()

       student_id  aptitude_score  performance_score
count  150.000000      150.000000         150.000000
mean    75.500000       44.240000           2.540667
std     43.445368       24.228133           0.652830
min      1.000000        9.000000           1.550000
25%     38.250000       22.000000           1.950000
50%     75.500000       38.000000           2.475000
75%    112.750000       65.000000           3.037500
max    150.000000       97.000000           3.800000